{"backend": "tensorflow", "config": {"input_layers": [["input_2", 0, 0]], "name": "model_2", "layers": [{"name": "input_2", "config": {"batch_input_shape": [null, 33, 33, 1], "sparse": false, "dtype": "float32", "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_7", "config": {"filters": 32, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [9, 9], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "name": "conv2d_7", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.30000001192092896}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "conv2d_8", "config": {"filters": 32, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "name": "conv2d_8", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.30000001192092896}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}], ["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "conv2d_9", "config": {"filters": 32, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "name": "conv2d_9", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "config": {"name": "leaky_re_lu_8", "trainable": true, "alpha": 0.30000001192092896}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_10", "config": {"filters": 32, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "name": "conv2d_10", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "config": {"name": "leaky_re_lu_9", "trainable": true, "alpha": 0.30000001192092896}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "conv2d_11", "config": {"filters": 32, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "name": "conv2d_11", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_10", "config": {"name": "leaky_re_lu_10", "trainable": true, "alpha": 0.30000001192092896}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "conv2d_12", "config": {"filters": 32, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "name": "conv2d_12", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "leaky_re_lu_11", "config": {"name": "leaky_re_lu_11", "trainable": true, "alpha": 0.30000001192092896}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "conv2d_13", "config": {"filters": 1, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "padding": "same", "kernel_regularizer": null, "name": "conv2d_13", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}], "output_layers": [["conv2d_13", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.5"}