{"backend": "tensorflow", "keras_version": "2.0.5", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv2d_5", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 33, 33, 1], "name": "input_1", "sparse": false, "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "use_bias": true, "data_format": "channels_last", "filters": 32, "padding": "same", "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [9, 9], "strides": [1, 1]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "leaky_re_lu_1", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_1"}, "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "use_bias": true, "data_format": "channels_last", "filters": 32, "padding": "same", "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "strides": [1, 1]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "leaky_re_lu_2", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_2"}, "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "use_bias": true, "data_format": "channels_last", "filters": 32, "padding": "same", "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "strides": [1, 1]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "leaky_re_lu_3", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_3"}, "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "use_bias": true, "data_format": "channels_last", "filters": 32, "padding": "same", "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "strides": [1, 1]}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "leaky_re_lu_4", "config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_4"}, "class_name": "LeakyReLU"}, {"inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"trainable": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "use_bias": true, "data_format": "channels_last", "filters": 1, "padding": "same", "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "strides": [1, 1]}, "class_name": "Conv2D"}]}, "class_name": "Model"}