{"keras_version": "2.0.5", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 33, 33, 1], "name": "input_2"}}, {"name": "conv2d_5", "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [9, 9], "filters": 64, "dilation_rate": [1, 1], "name": "conv2d_5"}}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_4"}}, {"name": "conv2d_6", "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "name": "conv2d_6"}}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_5"}}, {"name": "conv2d_7", "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 32, "dilation_rate": [1, 1], "name": "conv2d_7"}}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_6"}}, {"name": "conv2d_8", "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5], "filters": 1, "dilation_rate": [1, 1], "name": "conv2d_8"}}], "output_layers": [["conv2d_8", 0, 0]], "input_layers": [["input_2", 0, 0]], "name": "model_2"}}