{"config": {"input_layers": [["input_2", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 33, 33, 1], "dtype": "float32", "sparse": false, "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_2"}, {"config": {"filters": 64, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [9, 9], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_4"}, "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_4"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_3"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "leaky_re_lu_3"}, {"config": {"filters": 32, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [7, 7], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_5"}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "name": "conv2d_5"}, {"config": {"trainable": true, "alpha": 0.30000001192092896, "name": "leaky_re_lu_4"}, "class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "leaky_re_lu_4"}, {"config": {"filters": 1, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_size": [5, 5], "padding": "same", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_in", "distribution": "normal", "scale": 2.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_6"}, "class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "name": "conv2d_6"}], "name": "model_2", "output_layers": [["conv2d_6", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Model"}